Tekla Open API Reference for Tekla Structures 2025
ViewBase.Height Property
 The height of the view frame in paper coordinates.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Height { get; set; }
Public Property Height As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ViewBase Class
Tekla.Structures.Drawing Namespace